src/cf/InformationRegisters/GDS_ОбработкаВДокументообороте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ОбработкаВДокументообороте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_РезультатыВыполненияТочкиМаршрутаОбработкиДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_ТочкиМаршрутаСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыИнтегрированныеС1СДокументооборотом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыИнтегрированныеС1СДокументооборотом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияСогласованияВДокументообороте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСогласованияВДокументообороте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласованияВДокументообороте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_ИнтеграцияС1СДокументооборот3/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура GDS_ОбновлениеОбработокИзДокументооборота() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ЗаполнениеКонтрагентовНаМониторингеСПАРКРиски);
	
	ОбъектыДляОбновления = ОбъектыДляОбновленияОбработкиИзДокументооборота();
	Пока ОбъектыДляОбновления.Следующий() Цикл
		
		Попытка
			ЗаписатьОбработкуДокументооборота(ОбъектыДляОбновления.Объект);
		Исключение
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка обновления обработки из Документооборота'"),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектыДляОбновления.Объект.Ссылка.Метаданные(),
				ОбъектыДляОбновления.Объект,
				ТекстОшибки
			);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОбработкуДокументооборота(ОбъектИС, ТекущаяОбработка = Неопределено) Экспорт
	
	Если ТекущаяОбработка = Неопределено Тогда
		ТекущаяОбработка = ТекущаяОбработка(ОбъектИС);
	КонецЕсли;
	
	РегистрыСведений.GDS_ОбработкаВДокументообороте.Очистить(ОбъектИС);
	
	Если ТекущаяОбработка.ОбработкаПрервана Тогда
		ТочкаМаршрута = Справочники.GDS_ТочкиМаршрутаСогласования.НайтиСоздать("Обработка прервана");
		Результат = Справочники.GDS_РезультатыВыполненияТочкиМаршрутаОбработкиДО.НайтиСоздать("Не согласовано");
		
		Обработка = НовыйОбработкаДокументооборота();
		Обработка.Объект = ОбъектИС;
		Обработка.ТочкаМаршрута = ТочкаМаршрута;
		Обработка.Выполнено = Истина;
		Обработка.Результат = Результат;
		Обработка.Исполнитель = ТекущаяОбработка.ПрервалОбработку;
		Обработка.Комментарий = ТекущаяОбработка.ПричинаПрерывания;
		Обработка.Дата = ТекущаяОбработка.ДатаЗавершения;
		
		РегистрыСведений.GDS_ОбработкаВДокументообороте.Записать(Обработка);
		
	КонецЕсли;
	
	Порядок = 0;
	Для Каждого СтрокаОбработки Из ТекущаяОбработка.Согласования Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОбработки.ДатаИсполнения) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаОбработки.РезультатСогласования = "Пропущено" Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеТочкиМаршрута = СтрокаОбработки.ТочкаМаршрута;
		Если ЗначениеЗаполнено(СтрокаОбработки.РодительскийПроцесс) Тогда
			НаименованиеТочкиМаршрута = СтрокаОбработки.РодительскийПроцесс;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаименованиеТочкиМаршрута) Тогда
			Продолжить;
		КонецЕсли;
		
		ТочкаМаршрута = Справочники.GDS_ТочкиМаршрутаСогласования.НайтиСоздать(НаименованиеТочкиМаршрута);
		Результат = Справочники.GDS_РезультатыВыполненияТочкиМаршрутаОбработкиДО.НайтиСоздать(СтрокаОбработки.РезультатСогласования);
		Порядок = Порядок + 1;
		
		Обработка = НовыйОбработкаДокументооборота();
		Обработка.Объект = ОбъектИС;
		Обработка.ТочкаМаршрута = ТочкаМаршрута;
		Обработка.Дата = СтрокаОбработки.ДатаИсполнения;
		Обработка.Выполнено = СтрокаОбработки.Выполнено;
		Обработка.Результат = Результат;
		Обработка.Комментарий = СтрокаОбработки.РезультатВыполнения;
		Обработка.Исполнитель = СтрокаОбработки.ПолноеПредставлениеИсполнителя;
		Обработка.Порядок = Порядок;
		Обработка.ИдентификаторТочкиМаршрута = СтрокаОбработки.ИдентификаторТочкиМаршрута;
		
		РегистрыСведений.GDS_ОбработкаВДокументообороте.Записать(Обработка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбъектыДляОбновленияОбработкиИзДокументооборота() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыИнтегрированныеС1СДокументооборотом.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ОбъектыИнтегрированныеС1СДокументооборотом КАК ОбъектыИнтегрированныеС1СДокументооборотом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияВДокументообороте КАК СостоянияСогласованияВДокументообороте
	|		ПО ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО = СостоянияСогласованияВДокументообороте.ИдентификаторОбъектаДО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_ОбработкаВДокументообороте КАК GDS_ОбработкаВДокументообороте
	|		ПО ОбъектыИнтегрированныеС1СДокументооборотом.Объект = GDS_ОбработкаВДокументообороте.Объект
	|ГДЕ
	|	ЕСТЬNULL(GDS_ОбработкаВДокументообороте.ДатаОбновления, ДАТАВРЕМЯ(1, 1, 1)) < СостоянияСогласованияВДокументообороте.ДатаУстановки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыИнтегрированныеС1СДокументооборотом.Объект";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПодготовитьСогласования(ПредметСогласования) Экспорт
	
	Результат = ТекущаяОбработка(ПредметСогласования);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Согласования);
	
КонецФункции

Функция ТекущаяОбработка(ПредметСогласования) Экспорт
	
	Ответ = ТекущаяОбработкаОбъектаДО(ПредметСогласования);
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаЗавершения", Дата(1, 1, 1));
	Результат.Вставить("ОбработкаПрервана", Ложь);
	Результат.Вставить("ПрервалОбработку", "");
	Результат.Вставить("ПричинаПрерывания", "");
	Результат.Вставить("Согласования", НовыйТаблицаСогласования()); 
	
	Если Ответ = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ДатаЗавершения = Ответ.endDate;
	
	Если Ответ.interrupted <> Неопределено Тогда
		Результат.ОбработкаПрервана = Истина;
		Результат.ПрервалОбработку = Ответ.interrupted.objectID.presentation;
		Результат.ПричинаПрерывания = Ответ.terminationReason;
	КонецЕсли;
	
	ЗаполнитьРезультатПоОтветуДО(Ответ.objectProcessing, Результат.Согласования); 
	
	Возврат Результат;
	
КонецФункции

Функция ОбработкаАтивна(ОбъектИС) Экспорт
	
	ТекущийСтатус = СтатусОбработкиДО(ОбъектИС);
	Если ТекущийСтатус = "Выполняется" 
		Или ТекущийСтатус = "Завершена" Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СтатусОбработкиДО(ОбъектИС)
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ВызватьИсключение НСтр("ru = 'Работа с 1С:Документооборот версии 3.0'");
	КонецЕсли;
	
	ПредметВДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(ОбъектИС);
	Если ПредметВДО = Неопределено Тогда
		ВызватьИсключение ("Не найден объект в ДО");
	КонецЕсли;
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	Запрос = ИнтеграцияС1СДокументооборот3.ТекущаяОбработкаОбъектаЗапрос(Прокси, ПредметВДО.id, ПредметВДО.type);
	Ответ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Ответ);
	
	СостояниеОбработки = Неопределено;
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(Ответ, "objectProcessing") Тогда
		СостояниеОбработки = Ответ.objectProcessing.state; // Executing, Stopped, Completed, Terminated или пусто
		ДатаИзменения = Ответ.objectProcessing.stateChangeDate;
	КонецЕсли;
	
	ТекущийСтатус = "Не запущена";
	Если СостояниеОбработки = Неопределено Или СостояниеОбработки = "" Или СостояниеОбработки = "Terminated" Тогда
		ТекущийСтатус = "Не запущена";
	ИначеЕсли СостояниеОбработки = "Executing" Тогда
		ТекущийСтатус = "Выполняется";
	ИначеЕсли СостояниеОбработки = "Stopped" Тогда
		ТекущийСтатус = "Остановлена";
	ИначеЕсли СостояниеОбработки = "Completed" Тогда
		ТекущийСтатус = "Завершена";
	КонецЕсли;
	
	Возврат ТекущийСтатус;
	
КонецФункции

Функция ТекущееСостояниеОбработкиДО(Документ) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", "");
	Результат.Вставить("Исполнитель", "");
	Результат.Вставить("Комментарий", "");
	Результат.Вставить("ДатаУстановкиСтатуса", Дата(1, 1, 1));
	
	ДанныеОбработки = ТекущаяОбработка(Документ);
	
	Если ДанныеОбработки.ОбработкаПрервана Тогда
		Результат.Статус = "Обработка прервна";
		Результат.Исполнитель = ДанныеОбработки.ПрервалОбработку;
		Результат.Комментарий = ДанныеОбработки.ПричинаПрерывания;
		Результат.ДатаУстановкиСтатуса = ДанныеОбработки.ДатаЗавершения;
	КонецЕсли;
	
	Согласования = ДанныеОбработки.Согласования;
	
	Если Согласования.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Согласования.Сортировать("ДатаИсполнения Убыв");
	ТекущееСостояние = Согласования[0];
	
	Статус = ТекущееСостояние.РезультатСогласования;
	Если Статус = "На согласовании" Тогда
		СтрокиТочкиМаршрута = СтрРазделить(ТекущееСостояние.ТочкаМаршрута, " ");
		СтрокиТочкиМаршрута.Удалить(1);
		СтрокиТочкиМаршрута.Удалить(0);
		ДолжностьРодительныйПадеж = СтрСоединить(СтрокиТочкиМаршрута, " ");
		Статус = СтрШаблон("%1 у %2", Статус, СокрЛП(ДолжностьРодительныйПадеж));
	КонецЕсли;
	
	Результат.Статус = Статус;
	Результат.Исполнитель = ТекущееСостояние.ПолноеПредставлениеИсполнителя;
	Результат.ДатаУстановкиСтатуса = ТекущееСостояние.ДатаИсполнения;
	
	Возврат Результат;
	
КонецФункции 

Функция ТекущаяОбработкаОбъектаДО(Объект) Экспорт
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ВызватьИсключение НСтр("ru = 'Работа с 1С:Документооборот версии 3.0'");
	КонецЕсли;
	
	Если Не ВыполнитьПодключениеКДокументообороту() Тогда
		ВызватьИсключение НСтр("ru = 'Не выполнено подключениек 1С:Документооборот версии 3.0'");
	КонецЕсли;
	
	ПредметВДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(Объект);
	
	Если ПредметВДО = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	Запрос = ИнтеграцияС1СДокументооборот3.ТекущаяОбработкаОбъектаЗапрос(Прокси, ПредметВДО.id, ПредметВДО.type);
	
	Ответ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Ответ); 
	
	Возврат Ответ;
	
КонецФункции

Процедура ОбновитьОбъектДО(ОбъектИС) Экспорт
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ВызватьИсключение НСтр("ru = 'Работа с 1С:Документооборот версии 3.0'");
	КонецЕсли;

	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	МассивДанных = ДанныеОбновляемогоОбъектаДляОтправкиВДО(Прокси, ОбъектИС);
	
	ИмяЗапроса = "DMUpdateFromIncomingDataRequest";
	Запрос = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, ИмяЗапроса);
	СписокОбъектов = Запрос.objects; // СписокXDTO
	
	КонтрольОтправкиФайлов = ИнтеграцияС1СДокументооборотБазоваяФункциональность.КонтрольОтправкиФайлов();
	Для Каждого ОбъектДО Из МассивДанных Цикл
		
		ОбъектXDTO = ИнтеграцияС1СДокументооборот3Обмен.ПолучитьXDTOИзмененийИзОбъекта(
			Прокси,
			ОбъектДО,
			КонтрольОтправкиФайлов);
			
		СписокОбъектов.Добавить(ОбъектXDTO);
			
	КонецЦикла;
	
	Ответ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Ответ); 
	
КонецПроцедуры

Процедура ПерезапуститьОбработкуДО(Объект, ТекущееСостояние, Причина) Экспорт
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ВызватьИсключение НСтр("ru = 'Работа с 1С:Документооборот версии 3.0'");
	КонецЕсли;
	
	ПредметВДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(Объект);
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	ДанныеОбработки = ИнтеграцияС1СДокументооборот3КлиентСервер.ДанныеОбработки(ПредметВДО.id, ПредметВДО.type, ТекущееСостояние, Причина);
	Запрос = ИнтеграцияС1СДокументооборот3.ПерезапуститьОбработкуЗапрос(Прокси, ДанныеОбработки);
	
	Ответ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Ответ); 
	
КонецПроцедуры

Функция ПрерватьОбработкуДО(ОбъектИС, ТекущееСостояние = "", Причина = "") Экспорт
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ВызватьИсключение НСтр("ru = 'Работа с 1С:Документооборот версии 3.0'");
	КонецЕсли;
	
	ПредметВДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(ОбъектИС);
	Если ПредметВДО = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не объект не найден в 1С:Документооборот версии 3.0'");
	КонецЕсли;
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	ДанныеОбработки = ИнтеграцияС1СДокументооборот3КлиентСервер.ДанныеОбработки(ПредметВДО.id, ПредметВДО.type, ТекущееСостояние, Причина);
	Запрос = ИнтеграцияС1СДокументооборот3.ПрерватьОбработкуЗапрос(Прокси, ДанныеОбработки);
	
	Ответ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Ответ); 
	
	ОбработкаПрервана = Истина;
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, Ответ, "DMError") Тогда
		ОбработкаПрервана = Ложь;
		
		ТекстОшибки = СокрЛП(Ответ.description);
		
		ЗаписьЖурналаРегистрации(
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИмяСобытияЖурналаРегистрации(Ответ.subject),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	Иначе
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПриИзмененииСостоянияСогласования(
			ПредметВДО.id,
			ПредметВДО.type,
			Неопределено,
			Ложь,
			ОбъектИС
		);
	КонецЕсли;
	
	Возврат ОбработкаПрервана;
	
КонецФункции

Функция ОтправитьВДокументооборот(ОбъектИС) Экспорт
	
	РезультатОтправкиВДО = Ложь;
	
	Если Не ВыполнитьПодключениеКДокументообороту() Тогда
		Возврат РезультатОтправкиВДО;
	КонецЕсли;
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		
		МодульИнтеграцияС1СДокументооборот = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот");
		МодульИнтеграцияС1СДокументооборотВызовСервера = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотВызовСервера");
		
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		
		МодульИнтеграцияС1СДокументооборот = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот3");
		МодульИнтеграцияС1СДокументооборотВызовСервера = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот3ВызовСервера");
		
	КонецЕсли;
	
	ОбъектДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(ОбъектИС);
	
	Если ОбъектДО = Неопределено Тогда//не нашли наш объект	
		Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
			Правила = МодульИнтеграцияС1СДокументооборотВызовСервера.ПодходящиеПравила(ОбъектИС);
		ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
			Правила = МодульИнтеграцияС1СДокументооборотВызовСервера.ПодходящиеПравилаИнтеграцииОбъекта(ОбъектИС);
		КонецЕсли;
		
		Если Правила.Количество()=0 тогда
			Возврат РезультатОтправкиВДО;
		конецЕсли;
		
		ДействующееПравило = Правила[0];
		
		ОбъектДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьОбъектДОПоПравилу(ОбъектИС, ДействующееПравило.Ссылка);
		
		Если ТипЗнч(ОбъектДО) = Тип("Строка") Тогда
			ЗаписьЖурналаРегистрации("Отправка в Документооборот", УровеньЖурналаРегистрации.Ошибка, ОбъектИС.Метаданные(), ОбъектИС, ОбъектДО);
			Возврат РезультатОтправкиВДО;
		КонецЕсли;
		
		ПрисоединенныеФайлы = Новый Массив;
		РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ОбъектИС, ПрисоединенныеФайлы);
		ФайлыДляДО = Новый СписокЗначений;
		ФайлыДляДО.ЗагрузитьЗначения(ПрисоединенныеФайлы);
		
		Если ПрисоединенныеФайлы.Количество() > 0 Тогда
			МодульИнтеграцияС1СДокументооборотВызовСервера.ПеренестиФайлыИСвДО(ФайлыДляДО, ОбъектДО.id, ОбъектДО.type, ОбъектИС);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОшибки = "";
	РезультатОтправкиВДО = ИнтеграцияС1СДокументооборот3ВызовСервера.НачатьОбработку(ОбъектДО, Ложь, ТекстОшибки);
	
	Если СтрНачинаетсяС(ТекстОшибки, "Обработка уже была начата ранее. Текущее состояние обработки: Выполняется") Тогда
		РезультатОтправкиВДО = Истина;
	КонецЕсли;
	
	Возврат РезультатОтправкиВДО;
	
КонецФункции

Функция ТекущийСтатусДокументаДО(ОбъектИС, ТекущаяОбработка = Неопределено) Экспорт
	
	ТекущийСтатус = "НаСогласовании";
	
	Если ТекущаяОбработка = Неопределено Тогда
		ТекущаяОбработка = ТекущаяОбработка(ОбъектИС);
	КонецЕсли;
	
	ЗаписатьОбработкуДокументооборота(ОбъектИС, ТекущаяОбработка);
	
	Если ТекущаяОбработка.ОбработкаПрервана Тогда
		ТекущийСтатус = "Отклонен";
	КонецЕсли;
	
	Для Каждого СтрокаОбработки Из ТекущаяОбработка.Согласования Цикл
		
		Если СтрНайти(НРег(СтрокаОбработки.ТочкаМаршрута), "ознаком") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОбработки.РезультатСогласования = "Пропущено" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийСтатус = СтрокаОбработки.РезультатСогласования;
		
		Если Не СтрокаОбработки.Выполнено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущийСтатус;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьПодключениеКДокументообороту()
	
	УстановитьПривилегированныйРежим(Истина);
	ИмяПользователя = Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
	Пароль = Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда // прочтем настройки из пользовательского хранилища.
		
		ПарольСохранен = Ложь;
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизацииИзХранилищаОбщихНастроек(
			ИмяПользователя,
			Пароль,
			ПарольСохранен);
		
		Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
			
			ЗаписьЖурналаРегистрации(
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,,
				НСтр("ru = 'Для пользователя регламентного задания обмена не указано имя пользователя 1С:Документооборота'",
					ОбщегоНазначения.КодОсновногоЯзыка()));
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Если ПарольСохранен <> Истина Тогда
			
			ЗаписьЖурналаРегистрации(
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,,
				НСтр("ru = 'Для пользователя регламентного задания обмена не сохранен пароль 1С:Документооборота'",
					ОбщегоНазначения.КодОсновногоЯзыка()));
			
			Возврат Ложь;
			
		КонецЕсли;
		
		// Перенесем настройки в константы.
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиАвторизацииДляОбмена(
			ИмяПользователя,
			Пароль);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УдалитьНастройкиАвторизацииИзХранилищаОбщихНастроек();
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьНастройкиАвторизацииВПараметрыСеанса(
		ИмяПользователя,
		Пароль,
		Ложь,
		Ложь);
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса();
	
	Возврат Истина;
	
КонецФункции

Функция ДанныеОбновляемогоОбъектаДляОтправкиВДО(Прокси, Ссылка)
	
	МассивДанных = Новый Массив;
	СписокОбъектовИС = Новый Массив;
	СвязанныеОбъектыДО = Новый Соответствие;
	
	ЗапросИзменения = Новый Запрос;
	ЗапросИзменения.Текст =
		"ВЫБРАТЬ
		|	СУ_СписокДокументовЭДО.Ссылка КАК Объект,
		|	ЕСТЬNULL(ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО, """") КАК ИдентификаторОбъектаДО,
		|	ЕСТЬNULL(ОбъектыИнтегрированныеС1СДокументооборотом.ТипОбъектаДО, """") КАК ТипОбъектаДО
		|ИЗ
		|	Справочник.СУ_СписокДокументовЭДО КАК СУ_СписокДокументовЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыИнтегрированныеС1СДокументооборотом КАК ОбъектыИнтегрированныеС1СДокументооборотом
		|		ПО СУ_СписокДокументовЭДО.Ссылка = ОбъектыИнтегрированныеС1СДокументооборотом.Объект
		|ГДЕ
		|	СУ_СписокДокументовЭДО.Ссылка = &Ссылка";
	ЗапросИзменения.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаОбъекты = ЗапросИзменения.Выполнить().Выбрать();
	
	Если ВыборкаОбъекты.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаОбъекты.ИдентификаторОбъектаДО)Тогда
			СвязанныйОбъект = Новый Структура("ТипОбъектаДО, ИдентификаторОбъектаДО",
				ВыборкаОбъекты.ТипОбъектаДО,
				ВыборкаОбъекты.ИдентификаторОбъектаДО);
			СписокОбъектовИС.Добавить(ВыборкаОбъекты.Объект);
			СвязанныеОбъектыДО.Вставить(ВыборкаОбъекты.Объект, СвязанныйОбъект);
		КонецЕсли;
	КонецЕсли;
	
	ТребуютсяПечатныеФормы = ИнтеграцияС1СДокументооборот3.ДоступенФункционалФайлов();

	ПодходящиеПравилаИнтеграции = ИнтеграцияС1СДокументооборот3ВызовСервера.ПодходящиеПравилаИнтеграции(
		СписокОбъектовИС,
		Истина);
	СоответствиеПравилЗагрузкиВДООбъектамИС = ИнтеграцияС1СДокументооборот3.СоответствиеПравилЗагрузкиВДООбъектамИС(
		Прокси,
		СписокОбъектовИС,
		ПодходящиеПравилаИнтеграции);
	ПредварительныеДанные = ИнтеграцияС1СДокументооборот3.ПредварительныеДанныеДляВыгрузкиВДО(
		Прокси,
		СписокОбъектовИС,
		СоответствиеПравилЗагрузкиВДООбъектамИС,,
		ТребуютсяПечатныеФормы);
	СоответствиеСпискаВыраженийОбъектамИС = ПредварительныеДанные.СоответствиеСпискаВыраженийОбъектамИС;
	
	Для Каждого ОбъектИС Из СписокОбъектовИС Цикл
		
		ПравилоЗагрузкиВДО = СоответствиеПравилЗагрузкиВДООбъектамИС[ОбъектИС];
		Если ПравилоЗагрузкиВДО = Неопределено Тогда
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Для объекта ""%1"" (%2) не найдены подходящие правила интеграции с 1С:Документооборот.
				|Обратитесь к системному администратору'"),
				ОбъектИС,
				ТипЗнч(ОбъектИС));
				
			ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаХранимыхДанных, , 
				НСтр("ru = 'Необходимо проверить правила интеграции с Документооборотом'"));
		КонецЕсли;
		
		ИнтегрированныйОбъект = Новый Структура("Объект", ОбъектИС);
		ИнтегрированныйОбъект.Вставить("ТипОбъектаДО", СвязанныеОбъектыДО[ОбъектИС].ТипОбъектаДО);
		ИнтегрированныйОбъект.Вставить("ИдентификаторОбъектаДО", СвязанныеОбъектыДО[ОбъектИС].ИдентификаторОбъектаДО);
		ИнтегрированныйОбъект.Вставить("СписокВыгружаемыхТЧ", ПредварительныеДанные.СоответствиеСпискаВыгружаемыхТЧОбъектамИС[ОбъектИС]);
		ИнтегрированныйОбъект.Вставить("СписокВыражений", СоответствиеСпискаВыраженийОбъектамИС[ОбъектИС]);
		ИнтегрированныйОбъект.Вставить("ПравилоЗагрузкиВДО", ПравилоЗагрузкиВДО);
		ИнтегрированныйОбъект.Вставить("ТребуютсяПечатныеФормы", ТребуютсяПечатныеФормы);
		Если ТребуютсяПечатныеФормы Тогда
			ИнтегрированныйОбъект.Вставить("ПечатныеФормы", ПредварительныеДанные.СоответствиеПечатныхФормОбъектамИС[ОбъектИС]);
			ИнтегрированныйОбъект.Вставить("ТипыФайловПечатныхФорм", ПредварительныеДанные.ТипыФайловПечатныхФорм[ОбъектИС]);
		КонецЕсли;
		
		МассивДанных.Добавить(ИнтегрированныйОбъект);
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Процедура ЗаполнитьРезультатПоОтветуДО(ДанныеОбработки, Результат, РодительскийПроцесс = "")
	Если ДанныеОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Процесс Из ДанныеОбработки.actionsRows.rows Цикл
		Если Не Процесс.actionsRows = Неопределено Тогда
			ЗаполнитьРезультатПоОтветуДО(Процесс, Результат, Процесс.presentation);
		КонецЕсли;
		
		ПредставлениеСотрудника = Процесс.employeesPresentation;
		Если Не ЗначениеЗаполнено(ПредставлениеСотрудника) Тогда 
			Продолжить;
		КонецЕсли;
		
		ДанныеСотрудника = ДанныеСотрудникаИзПредставленияДО(ПредставлениеСотрудника);
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Должность                      = ДанныеСотрудника.Должность;
		НоваяСтрока.Исполнитель                    = ДанныеСотрудника.ФИО;
		НоваяСтрока.ПолноеПредставлениеИсполнителя = ПредставлениеСотрудника;
		НоваяСтрока.РезультатСогласования          = Процесс.statePresentation;
		НоваяСтрока.ДатаИсполнения                 = Процесс.statusDate;
		НоваяСтрока.РезультатВыполнения            = Процесс.comment;
		НоваяСтрока.Подразделение                  = ДанныеСотрудника.Подразделение;
		НоваяСтрока.ТочкаМаршрута                  = Процесс.presentation;
		НоваяСтрока.РодительскийПроцесс            = РодительскийПроцесс;
		НоваяСтрока.ИдентификаторТочкиМаршрута     = Процесс.additionalFields.id;
		НоваяСтрока.Выполнено                      = Ложь;
		Если Процесс.additionalFields.state = "Completed" Тогда
			НоваяСтрока.Выполнено = Истина; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ДанныеСотрудникаИзПредставленияДО(Представление)
	
	Результат = Новый Структура;
	Результат.Вставить("ФИО", "");
	Результат.Вставить("Подразделение", "");
	Результат.Вставить("Должность", "");
	
	ПозицияОткрывающейСкобки = СтрНайти(Представление, "(");
	Если ПозицияОткрывающейСкобки > 0 Тогда
		ПозицияЗапятойПослеСкобки = СтрНайти(Представление, ",", , ПозицияОткрывающейСкобки);
		
		Если ПозицияЗапятойПослеСкобки = 0 Тогда
			ПозицияЗапятойПослеСкобки = ПозицияОткрывающейСкобки;
		КонецЕсли;
		
		ПозицияЗакрывающейСкобки = СтрНайти(Представление, ")", , ПозицияЗапятойПослеСкобки); 
		
		Результат.ФИО = СокрЛП(Лев(Представление, ПозицияОткрывающейСкобки - 1));
		Результат.Подразделение = СокрЛП(Сред(Представление, ПозицияОткрывающейСкобки + 1, ПозицияЗапятойПослеСкобки - ПозицияОткрывающейСкобки - 1));
		Результат.Должность = СокрЛП(Сред(Представление, ПозицияЗапятойПослеСкобки + 1, ПозицияЗакрывающейСкобки - ПозицияЗапятойПослеСкобки - 1)); 
	Иначе 
		Результат.ФИО = Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТаблицаСогласования()
	
	ТаблицаСогласования = Новый ТаблицаЗначений;
	ТаблицаСогласования.Колонки.добавить("Должность"); 
	ТаблицаСогласования.Колонки.добавить("Подразделение"); 
	ТаблицаСогласования.Колонки.добавить("Исполнитель"); 
	ТаблицаСогласования.Колонки.добавить("ПолноеПредставлениеИсполнителя"); 
	ТаблицаСогласования.Колонки.добавить("РезультатСогласования"); 
	ТаблицаСогласования.Колонки.добавить("ДатаИсполнения"); 
	ТаблицаСогласования.Колонки.добавить("РезультатВыполнения"); 
	ТаблицаСогласования.Колонки.добавить("Выполнено"); 
	ТаблицаСогласования.Колонки.добавить("ТочкаМаршрута"); 
	ТаблицаСогласования.Колонки.добавить("РодительскийПроцесс");
	ТаблицаСогласования.Колонки.добавить("ИдентификаторТочкиМаршрута", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	Возврат ТаблицаСогласования;
	
КонецФункции

Функция НовыйОбработкаДокументооборота()
	Обработка = Новый Структура;
	Обработка.Вставить("Объект", );
	Обработка.Вставить("ТочкаМаршрута", Справочники.GDS_ТочкиМаршрутаСогласования.ПустаяСсылка());
	Обработка.Вставить("ИдентификаторТочкиМаршрута", "");
	Обработка.Вставить("Дата", Дата(1, 1, 1));
	Обработка.Вставить("Выполнено", Ложь);
	Обработка.Вставить("Результат", "");
	Обработка.Вставить("Комментарий", "");
	Обработка.Вставить("Исполнитель", "");
	Обработка.Вставить("Порядок", 0);
	
	Возврат Обработка;
КонецФункции

#КонецОбласти
